wsman-api/sample/wsman.soap.session/req4.xml


<?xml version="1.0" encoding="utf-8"?>
<env:Envelope xmlns:w="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd" xmlns:x="http://schemas.xmlsoap.org/ws/2004/09/transfer" xmlns:rsp="http://schemas.microsoft.com/wbem/wsman/1/windows/shell" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:n="http://schemas.xmlsoap.org/ws/2004/09/enumeration" xmlns:p="http://schemas.microsoft.com/wbem/wsman/1/wsman.xsd" xmlns:cfg="http://schemas.microsoft.com/wbem/wsman/1/config" xmlns:b="http://schemas.dmtf.org/wbem/wsman/1/cimbinding.xsd" xmlns:env="http://www.w3.org/2003/05/soap-envelope" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:a="http://schemas.xmlsoap.org/ws/2004/08/addressing">
	<env:Header>
		<a:Action mustUnderstand="true">http://schemas.microsoft.com/wbem/wsman/1/windows/shell/Signal</a:Action>
		<a:MessageID>uuid:64a7ec4e-6ef9-4e42-adab-2d2b68dbe06c</a:MessageID>
		<w:SelectorSet>
			<w:Selector Name="ShellId">17C45B31-ACBE-48A2-A77D-AAA9518C13AA</w:Selector>
		</w:SelectorSet>
		<a:ReplyTo>
			<a:Address mustUnderstand="true">http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</a:Address>
		</a:ReplyTo>
		<w:MaxEnvelopeSize mustUnderstand="true">153600</w:MaxEnvelopeSize>
		<w:Locale mustUnderstand="false" xml:lang="en-US"/>
		<w:OperationTimeout>PT60S</w:OperationTimeout>
		<p:DataLocale mustUnderstand="false" xml:lang="en-US"/>
		<a:To>http://windows-host:5985/wsman</a:To>
		<w:ResourceURI mustUnderstand="true">http://schemas.microsoft.com/wbem/wsman/1/windows/shell/cmd</w:ResourceURI>
	</env:Header>
	<env:Body>
		<rsp:Signal CommandId="59EFF516-BF7A-418F-BE6F-C2E3D151CECE">
			<rsp:Code>http://schemas.microsoft.com/wbem/wsman/1/windows/shell/signal/terminate</rsp:Code>
		</rsp:Signal>
	</env:Body>
</env:Envelope>